In [111]:
import pandas as pd 

data= {
    'EmployeeID':[101,102,103,104,105],
    'Name':['Alice','Bob','Charlie','dinana','Eva'],
    'Department':['HR','IT','Finance','IT','HR'],
    'Age':[25,30,28,35,24],
    'Salary':[50000,60000,58000,72000,52000],
    'JoiningDate':['2020-01-15','2019-03-12','2021-05-20','2018-07-25','2022-05-16'],
    'PerformanceScore':[85,90,78,92,88]
}

# Dataframe

In [112]:
df=pd.DataFrame(data)
print(df)

   EmployeeID     Name Department  Age  Salary JoiningDate  PerformanceScore
0         101    Alice         HR   25   50000  2020-01-15                85
1         102      Bob         IT   30   60000  2019-03-12                90
2         103  Charlie    Finance   28   58000  2021-05-20                78
3         104   dinana         IT   35   72000  2018-07-25                92
4         105      Eva         HR   24   52000  2022-05-16                88

In [113]:
df

   EmployeeID     Name Department  Age  Salary JoiningDate  PerformanceScore
0         101    Alice         HR   25   50000  2020-01-15                85
1         102      Bob         IT   30   60000  2019-03-12                90
2         103  Charlie    Finance   28   58000  2021-05-20                78
3         104   dinana         IT   35   72000  2018-07-25                92
4         105      Eva         HR   24   52000  2022-05-16                88

# First three row

In [114]:
df.head(3)

   EmployeeID     Name Department  Age  Salary JoiningDate  PerformanceScore
0         101    Alice         HR   25   50000  2020-01-15                85
1         102      Bob         IT   30   60000  2019-03-12                90
2         103  Charlie    Finance   28   58000  2021-05-20                78

# Total number of employee

In [115]:
df['Name'].count()

np.int64(5)

# Three any missing values

In [116]:
missing_value=df.isnull().sum()
print(missing_value)

EmployeeID          0
Name                0
Department          0
Age                 0
Salary              0
JoiningDate         0
PerformanceScore    0
dtype: int64

# Employee of 'IT' department

In [117]:
employee=df[df['Department']=='IT']
print(employee)

   EmployeeID    Name Department  Age  Salary JoiningDate  PerformanceScore
1         102     Bob         IT   30   60000  2019-03-12                90
3         104  dinana         IT   35   72000  2018-07-25                92

# Retrieve delails of employee with a perfomanceScore greater than 85

In [100]:
df[df['PerformanceScore']>85]

   EmployeeID    Name Department  Age  Salary JoiningDate  PerformanceScore
1         102     Bob         IT   30   60000  2019-03-12                90
3         104  dinana         IT   35   72000  2018-07-25                92
4         105     Eva         HR   24   52000  2022-05-16                88

# Sort the Dataframe by 'Salary' in descending order

In [123]:
df['Salary'].sort_values(ascending=False)

3    72000
1    60000
2    58000
4    52000
0    50000
Name: Salary, dtype: int64

# Avarage age of employee

In [124]:
df['Age'].mean()

np.float64(28.4)

# Total salary of HR department

In [122]:
df[df['Department']=='HR'].sum()

EmployeeID                           206
Name                            AliceEva
Department                          HRHR
Age                                   49
Salary                            102000
JoiningDate         2020-01-152022-05-16
PerformanceScore                     173
dtype: object